<span>
<img src="http://www.sobigdata.eu/sites/default/files/logo-SoBigData-DEFINITIVO.png" width="180px" align="right"/>
</span>
<span>
<b>Author:</b> <a href="http://about.giuliorossetti.net">Giulio Rossetti</a><br/>
<b>Python version:</b>  3.6<br/>
<b>Last update:</b> 22/01/2018
</span>

In [1]:
import pandas as pd
import numpy as np

# Sample data
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

# dataframe
df = pd.DataFrame(exam_data , index=labels)

### 1. Series
Write a Python program to add, subtract, multiple and divide two Pandas Series.

Sample Series: [2, 4, 6, 8, 10], [1, 3, 5, 7, 9]

In [ ]:
# Solution

ds1 = pd.Series([2, 4, 6, 8, 10])
ds2 = pd.Series([1, 3, 5, 7, 9])
ds_plus = ds1 + ds2
ds_sub = ds1 - ds2
ds_prod = ds1 * ds2
ds_div = ds1 / ds2
ds_plus, ds_sub, ds_prod, ds_div

### 2. DataFrame: Column Selection
Write a Python program to select the 'name' and 'score' columns from the following DataFrame.

In [ ]:
# solution

print("Select specific columns:")
print(df[['name', 'score']])

### 3. DataFrame: Filtering by row value
Write a Python program to select the rows where the score is greater than 10

In [10]:
# solution

df[df['score'] > 10]

   attempts       name qualify  score
a         1  Anastasia     yes   12.5
c         2  Katherine     yes   16.5
f         3    Michael     yes   20.0
g         1    Matthew     yes   14.5
j         1      Jonas     yes   19.0

### 4. DataFrame: Update value
Write a Python program to change the score in row 'd' to 11.5.

In [25]:
# solution

print("Original data frame:")
print(df)
print("\nChange the score in row 'd' to 11.5:")
df.loc['d', 'score'] = 11.5
print(df)

Original data frame:
   attempts       name qualify  score  scat
a         1  Anastasia     yes   12.5  12.5
b         3       Dima      no    9.0  27.0
c         2  Katherine     yes   16.5  33.0
d         3      James      no    NaN   NaN
e         2      Emily      no    9.0  18.0
f         3    Michael     yes   20.0  60.0
g         1    Matthew     yes   14.5  14.5
h         1      Laura      no    NaN   NaN
i         2      Kevin      no    8.0  16.0
j         1      Jonas     yes   19.0  19.0

Change the score in row 'd' to 11.5:
   attempts       name qualify  score  scat
a         1  Anastasia     yes   12.5  12.5
b         3       Dima      no    9.0  27.0
c         2  Katherine     yes   16.5  33.0
d         3      James      no   11.5   NaN
e         2      Emily      no    9.0  18.0
f         3    Michael     yes   20.0  60.0
g         1    Matthew     yes   14.5  14.5
h         1      Laura      no    NaN   NaN
i         2      Kevin      no    8.0  16.0
j         1      Jonas     yes   19.0  19.0

### 5. DataFrame: Append row
Write a Python program to append a new row 'k' to data frame with given values for each column. Now delete the new row and return the original DataFrame.

Values for each column will be:
 - name : "Suresh", 
 - score: 15.5, 
 - attempts: 1, 
 - qualify: "yes", 
 - label: "k"

In [ ]:
# Solution 

df.loc['k'] = [1, 'Suresh', 'yes', 15.5]
df

In [ ]:
df = df.drop('k')
df

### 6. DataFrame: Create new column
Write a Python program to create a novel column containing the product of ``score`` and ``attempts``

In [12]:
# Solution 

df['scat'] = df['score'] * df['attempts']
df

   attempts       name qualify  score  scat
a         1  Anastasia     yes   12.5  12.5
b         3       Dima      no    9.0  27.0
c         2  Katherine     yes   16.5  33.0
d         3      James      no    NaN   NaN
e         2      Emily      no    9.0  18.0
f         3    Michael     yes   20.0  60.0
g         1    Matthew     yes   14.5  14.5
h         1      Laura      no    NaN   NaN
i         2      Kevin      no    8.0  16.0
j         1      Jonas     yes   19.0  19.0

### 7. Grouping

Group records w.r.t. the ``qualify`` feature, then compute the mean of
- min, max, mean of the remaining features

In [ ]:
# Solution

df.groupby(['qualify']).mean()

### 8. Subsets
Select the records indexed as ``a`` and ``b`` filtering in only th columns ``score`` and ``qualify``

In [24]:
# Solution

df.loc[['a', 'b'],['score','qualify']]

   score qualify
a   12.5     yes
b    9.0      no